/********************************************************
解构赋值允许指定默认值
********************************************************/

let [foo = true] = [];
console.log(foo); //true 

let [x, y = 'b'] = ['a'];
console.log(x, y); //a b

let [a, b = 'y'] = ['x', undefined];
console.log(a, b); // x y


/********************************************************
ES6 内部使用严格相等运算符（===），判断一个位置是否有值。
所以，如果一个数组成员不严格等于undefined，默认值是不会生效的
********************************************************/

let [u = 1] = [undefined];
console.log(u); //1

let [v = 1] = [null];
console.log(v); //null